# Team Frontable

In [1]:
# Load in SQL, Pandas and SQLite

%load_ext sql

import pandas as pd
import sqlite3

In [2]:
%sql sqlite:///CourseData.db 
conn = sqlite3.connect('CourseData.db')

# 1) Table Creation
##  A) Create LOCATION Table

In [3]:


%%sql

DROP TABLE IF EXISTS LOCATION;
CREATE TABLE LOCATION (
    LocationID INTEGER PRIMARY KEY,
    Location_Code TEXT,
    Building TEXT,
    Room TEXT
);

 * sqlite:///CourseData.db
Done.
Done.

[]

## B) INSTRUCTOR Table

In [4]:


%%sql

DROP TABLE IF EXISTS INSTRUCTOR;
CREATE TABLE INSTRUCTOR (
    InstructorID INTEGER PRIMARY KEY,
    InstructorName TEXT 
);

 * sqlite:///CourseData.db
Done.
Done.

[]

## C) PROGRAM Table

In [5]:


%%sql

DROP TABLE IF EXISTS PROGRAM;
CREATE TABLE PROGRAM (
    ProgramID INTEGER PRIMARY KEY,
    ProgramCode TEXT,
    ProgramName TEXT
);

 * sqlite:///CourseData.db
Done.
Done.

[]

## D) COURSE Table

In [6]:

%%sql

DROP TABLE IF EXISTS COURSE;
CREATE TABLE COURSE (
    CatalogID TEXT,
    CourseID INTEGER PRIMARY KEY,
    ProgramID INTEGER NOT NULL,
    CourseTitle TEXT NOT NULL,
    Description TEXT,
    Attributes TEXT,
    Coreqs TEXT,
    Prereqs TEXT,
    Fees TEXT,
    Credits INTEGER NOT NULL,
    FOREIGN KEY (ProgramID) REFERENCES PROGRAM (ProgramID)
);

 * sqlite:///CourseData.db
Done.
Done.

[]

## E) COURSE_MEETING Table

In [7]:


%%sql

DROP TABLE IF EXISTS COURSE_MEETING;
CREATE TABLE COURSE_MEETING (
    CourseMeetingID INTEGER PRIMARY KEY,
    CatalogID TEXT,
    Location TEXT,
    StartDateTime TEXT,
    EndDateTime TEXT,
    FOREIGN KEY (Location) REFERENCES LOCATION (Location)
);

 * sqlite:///CourseData.db
Done.
Done.

[]

## F) COURSE_OFFERING Table

In [8]:

%%sql

DROP TABLE IF EXISTS COURSE_OFFERING;
CREATE TABLE COURSE_OFFERING (
    CourseOfferingID INTEGER PRIMARY KEY,
    CatalogID TEXT NOT NULL,
    CourseTitle TEXT NOT NULL,
    InstructorName TEXT NOT NULL,
    Section TEXT, 
    Meetings TEXT NOT NULL,
    Timecodes TEXT NOT NULL,
    Term TEXT NOT NULL,
    StartDay TEXT NOT NULL,
    End TEXT NOT NULL,    
    Cap INTEGER NOT NULL,
    Act INTEGER NOT NULL,
    Rem INTEGER NOT NULL,
    FOREIGN KEY (CatalogID) REFERENCES COURSE_MEETING (CatalogID)
    FOREIGN KEY (InstructorName) REFERENCES INSTRUCTOR 
    (InstructorName)
    FOREIGN KEY (CourseTitle) REFERENCES COURSE (CourseTitle)
);

 * sqlite:///CourseData.db
Done.
Done.

[]

# 2) DataFrame Creation using Python/Pandas

## First DataFrame using Courses.csv

In [9]:

cs=pd.read_csv("Courses.csv", encoding='utf-8' )

cs.head()

,term,crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem
0,Fall2014,70384,AC 0011,C01,3,Introduction to Financial Accounting,"[{'days': 'TF', 'times': '0800am-0915am', 'dat...",['TF 0800am-0915am 09/02-12/08 DSB 105'],Michael P. Coyne,0,31,-31
1,Fall2014,70385,AC 0011,C02,3,Introduction to Financial Accounting,"[{'days': 'TF', 'times': '0930am-1045am', 'dat...",['TF 0930am-1045am 09/02-12/08 DSB 105'],Michael P. Coyne,0,31,-31
2,Fall2014,70382,AC 0011,C03,3,Introduction to Financial Accounting,"[{'days': 'TF', 'times': '1230pm-0145pm', 'dat...",['TF 1230pm-0145pm 09/02-12/08 DSB 105'],Michael P. Coyne,0,31,-31
3,Fall2014,70291,AC 0011,C04,3,Introduction to Financial Accounting,"[{'days': 'MR', 'times': '1100am-1215pm', 'dat...",['MR 1100am-1215pm 09/02-12/08 DSB 111'],Rebecca I. Bloch,0,29,-29
4,Fall2014,70350,AC 0011,C05,3,Introduction to Financial Accounting,"[{'days': 'MR', 'times': '1230pm-0145pm', 'dat...",['MR 1230pm-0145pm 09/02-12/08 DSB 111'],Rebecca I. Bloch,0,30,-30

In [10]:
#Replace missing values with a string '[]'

#cs1.fillna('[]').head()

In [11]:
#Count 

#cs1.count()

In [12]:
#Create dataframe cm from Course_meetings.csv. 
#Displaying first 5 results

cm=pd.read_csv('Course_meetings.csv')
cm.head()

       term    crn location day                start                  end
0  Fall2014  70384  DSB 105   T  2014-09-02T08:00:00  2014-09-02T09:15:00
1  Fall2014  70384  DSB 105   F  2014-09-05T08:00:00  2014-09-05T09:15:00
2  Fall2014  70384  DSB 105   T  2014-09-09T08:00:00  2014-09-09T09:15:00
3  Fall2014  70384  DSB 105   F  2014-09-12T08:00:00  2014-09-12T09:15:00
4  Fall2014  70384  DSB 105   T  2014-09-16T08:00:00  2014-09-16T09:15:00

In [13]:
#cm.fillna('[]').head()

In [14]:
cm.count()

term        284925
crn         284925
location    284925
day         284925
start       284925
end         284925
dtype: int64

In [15]:
cm.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 284925 entries, 0 to 284924
Data columns (total 6 columns):
term        284925 non-null object
crn         284925 non-null int64
location    284925 non-null object
day         284925 non-null object
start       284925 non-null object
end         284925 non-null object
dtypes: int64(1), object(5)
memory usage: 13.0+ MB

In [16]:
# Duplicate data for the 2 academic years
#cc=pd.read_csv('SourceData/CourseCatalog2017_2019.csv')
cc=pd.read_csv('SourceData/Catalogs/CourseCatalog2017_2018.csv')
#cc1=cc.drop(["catalog_id" , "course_title" , "credits"], axis=1)
#cc1.head()
cc.head()

,program_code,program_name,catalog_id,course_title,credits,prereqs,coreqs,fees,attributes,description
0,AN,Asian Studies,AN 0301,Independent Study,1-3 Credits,NaN,NaN,NaN,NaN,Students undertake an individualized program o...
1,AN,Asian Studies,AN 0310,Asian Studies Seminar,3 Credits,NaN,NaN,NaN,NaN,This seminar examines selected topics concerni...
2,BU,Business,BU 0211,Legal Environment of Business,3 Credits,Junior standing.,NaN,NaN,NaN,This course examines the broad philosophical a...
3,BU,Business,BU 0220,Environmental Law and Policy,3 Credits,NaN,NaN,NaN,"EVME Environmental Studies Major Elective, EVP...",This course surveys issues arising out of fede...
4,BU,Business,BU 0311,"The Law of Contracts, Sales, and Property",3 Credits,BU 0211.,NaN,NaN,NaN,This course examines the components of common ...

In [17]:
cc.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2220 entries, 0 to 2219
Data columns (total 10 columns):
program_code    2220 non-null object
program_name    2220 non-null object
catalog_id      2220 non-null object
course_title    2220 non-null object
credits         2220 non-null object
prereqs         1129 non-null object
coreqs          98 non-null object
fees            125 non-null object
attributes      766 non-null object
description     2118 non-null object
dtypes: object(10)
memory usage: 173.6+ KB

In [18]:
cc.describe()

,program_code,program_name,catalog_id,course_title,credits,prereqs,coreqs,fees,attributes,description
count,2220,2220,2220,2220,2220,1129,98,125,766,2118
unique,83,82,2220,1900,20,472,92,9,321,1961
top,EN,English,SO 0169,Internship,3 Credits,HI 0010 or CL 0115 or CL 0116.,BI 0324 or BI 0325 or CH 0324 or CH 0325.,$55 Science Lab Fee,VPCH Visual and Performing Arts Core: History ...,"This course, a continuation of"
freq,99,99,1,49,1871,82,4,40,42,22

In [19]:
cc.count()

program_code    2220
program_name    2220
catalog_id      2220
course_title    2220
credits         2220
prereqs         1129
coreqs            98
fees             125
attributes       766
description     2118
dtype: int64

In [20]:
#Data warehouse

#CourseData = pd.concat([cc1,cs1,cm], axis = 1)
#CourseData.head()

In [21]:
# 3 dataframes merged
DataSet = cm.merge(cs, on=['term', 'crn']).merge(cc, how='left', on = 'catalog_id')
#cs.merge(cc, how='left', on = 'catalog_id').head()
DataSet.head()

,term,crn,location,day,start,end,catalog_id,section,credits_x,title,...,rem,program_code,program_name,course_title,credits_y,prereqs,coreqs,fees,attributes,description
0,Fall2014,70384,DSB 105,T,2014-09-02T08:00:00,2014-09-02T09:15:00,AC 0011,C01,3,Introduction to Financial Accounting,...,-31,AC,Accounting,Introduction to Financial Accounting,3 Credits,NaN,NaN,NaN,NaN,This course introduces students to financial a...
1,Fall2014,70384,DSB 105,F,2014-09-05T08:00:00,2014-09-05T09:15:00,AC 0011,C01,3,Introduction to Financial Accounting,...,-31,AC,Accounting,Introduction to Financial Accounting,3 Credits,NaN,NaN,NaN,NaN,This course introduces students to financial a...
2,Fall2014,70384,DSB 105,T,2014-09-09T08:00:00,2014-09-09T09:15:00,AC 0011,C01,3,Introduction to Financial Accounting,...,-31,AC,Accounting,Introduction to Financial Accounting,3 Credits,NaN,NaN,NaN,NaN,This course introduces students to financial a...
3,Fall2014,70384,DSB 105,F,2014-09-12T08:00:00,2014-09-12T09:15:00,AC 0011,C01,3,Introduction to Financial Accounting,...,-31,AC,Accounting,Introduction to Financial Accounting,3 Credits,NaN,NaN,NaN,NaN,This course introduces students to financial a...
4,Fall2014,70384,DSB 105,T,2014-09-16T08:00:00,2014-09-16T09:15:00,AC 0011,C01,3,Introduction to Financial Accounting,...,-31,AC,Accounting,Introduction to Financial Accounting,3 Credits,NaN,NaN,NaN,NaN,This course introduces students to financial a...

In [22]:
#CourseData.fillna('[]').head()

In [23]:
#Checking if description matched program_name in old dataframe
#DataSet.loc[:,['program_name', 'description']].head()

In [24]:
# Integrity checks
DataSet.count()

term                  284925
crn                   284925
location              284925
day                   284925
start                 284925
end                   284925
catalog_id            284925
section               284925
credits_x             284925
title                 284925
meetings              284925
timecodes             284925
primary_instructor    284925
cap                   284925
act                   284925
rem                   284925
program_code          273704
program_name          273704
course_title          273704
credits_y             273704
prereqs               145121
coreqs                 16662
fees                   14253
attributes             73784
description           260686
dtype: int64

In [25]:
# Finding which fields are null
cc.isna().any()

program_code    False
program_name    False
catalog_id      False
course_title    False
credits         False
prereqs          True
coreqs           True
fees             True
attributes       True
description      True
dtype: bool

In [26]:
#cc1.fillna('[]').head()

# 3) Load DataFrame into SQL Tables

In [27]:
#CourseData.to_sql('CourseData',conn,if_exists='append',index=False)
DataSet.to_sql('DataSet',conn,if_exists='append',index=False)

In [28]:
%%sql 
SELECT *
FROM DataSet
LIMIT 5

 * sqlite:///CourseData.db
Done.

[('Fall2014', 70384, 'DSB 105', 'T', '2014-09-02T08:00:00', '2014-09-02T09:15:00', 'AC 0011', 'C01', '3', 'Introduction to Financial Accounting', "[{'days': 'TF', 'times': '0800am-0915am', 'dates': '09/02-12/08', 'location': 'DSB 105'}]", "['TF 0800am-0915am 09/02-12/08 DSB 105']", 'Michael P.  Coyne', 0, 31, -31, 'AC', 'Accounting', 'Introduction to Financial Accounting', '3 Credits', None, None, None, None, 'This course introduces students to financial accounting. Students learn to read and comprehend published financial statements and are introduced to t ... (34 characters truncated) ... pics include financial statement analysis; accrual accounting; revenue and expense recognition; and accounting for assets, liabilities, and equities.'),
 ('Fall2014', 70384, 'DSB 105', 'F', '2014-09-05T08:00:00', '2014-09-05T09:15:00', 'AC 0011', 'C01', '3', 'Introduction to Financial Accounting', "[{'days': 'TF', 'times': '0800am-0915am', 'dates': '09/02-12/08', 'location': 'DSB 105'}]", "['TF 0800am-0915am 09/02-12/08 DSB 105']", 'Michael P.  Coyne', 0, 31, -31, 'AC', 'Accounting', 'Introduction to Financial Accounting', '3 Credits', None, None, None, None, 'This course introduces students to financial accounting. Students learn to read and comprehend published financial statements and are introduced to t ... (34 characters truncated) ... pics include financial statement analysis; accrual accounting; revenue and expense recognition; and accounting for assets, liabilities, and equities.'),
 ('Fall2014', 70384, 'DSB 105', 'T', '2014-09-09T08:00:00', '2014-09-09T09:15:00', 'AC 0011', 'C01', '3', 'Introduction to Financial Accounting', "[{'days': 'TF', 'times': '0800am-0915am', 'dates': '09/02-12/08', 'location': 'DSB 105'}]", "['TF 0800am-0915am 09/02-12/08 DSB 105']", 'Michael P.  Coyne', 0, 31, -31, 'AC', 'Accounting', 'Introduction to Financial Accounting', '3 Credits', None, None, None, None, 'This course introduces students to financial accounting. Students learn to read and comprehend published financial statements and are introduced to t ... (34 characters truncated) ... pics include financial statement analysis; accrual accounting; revenue and expense recognition; and accounting for assets, liabilities, and equities.'),
 ('Fall2014', 70384, 'DSB 105', 'F', '2014-09-12T08:00:00', '2014-09-12T09:15:00', 'AC 0011', 'C01', '3', 'Introduction to Financial Accounting', "[{'days': 'TF', 'times': '0800am-0915am', 'dates': '09/02-12/08', 'location': 'DSB 105'}]", "['TF 0800am-0915am 09/02-12/08 DSB 105']", 'Michael P.  Coyne', 0, 31, -31, 'AC', 'Accounting', 'Introduction to Financial Accounting', '3 Credits', None, None, None, None, 'This course introduces students to financial accounting. Students learn to read and comprehend published financial statements and are introduced to t ... (34 characters truncated) ... pics include financial statement analysis; accrual accounting; revenue and expense recognition; and accounting for assets, liabilities, and equities.'),
 ('Fall2014', 70384, 'DSB 105', 'T', '2014-09-16T08:00:00', '2014-09-16T09:15:00', 'AC 0011', 'C01', '3', 'Introduction to Financial Accounting', "[{'days': 'TF', 'times': '0800am-0915am', 'dates': '09/02-12/08', 'location': 'DSB 105'}]", "['TF 0800am-0915am 09/02-12/08 DSB 105']", 'Michael P.  Coyne', 0, 31, -31, 'AC', 'Accounting', 'Introduction to Financial Accounting', '3 Credits', None, None, None, None, 'This course introduces students to financial accounting. Students learn to read and comprehend published financial statements and are introduced to t ... (34 characters truncated) ... pics include financial statement analysis; accrual accounting; revenue and expense recognition; and accounting for assets, liabilities, and equities.')]

In [29]:
%%sql 
DELETE FROM LOCATION;
-- instr first instance of a character
-- substr sub strings from start to end
INSERT INTO LOCATION (Location_Code, Building, Room)
SELECT DISTINCT Location as Location_Code, substr(Location,1,instr(Location, ' ')) as Building,substr(Location,instr(Location, ' ')) as Room 
FROM DataSet

 * sqlite:///CourseData.db
0 rows affected.
Done.

[]

In [30]:
#Ingegrity check

%%sql
SELECT *
FROM LOCATION
LIMIT 5

 * sqlite:///CourseData.db
Done.

[(1, 'DSB 105', 'DSB ', ' 105'),
 (2, 'DSB 111', 'DSB ', ' 111'),
 (3, 'DSB 110A', 'DSB ', ' 110A'),
 (4, 'DSB 108', 'DSB ', ' 108'),
 (5, 'DSB 110B', 'DSB ', ' 110B')]

In [31]:
%%sql
DELETE FROM INSTRUCTOR;

INSERT INTO INSTRUCTOR (InstructorName)
SELECT DISTINCT primary_instructor
FROM DataSet

 * sqlite:///CourseData.db
0 rows affected.
1048 rows affected.

[]

In [32]:
%%sql
SELECT *
FROM INSTRUCTOR
LIMIT 5

 * sqlite:///CourseData.db
Done.

[(1, 'Michael P.  Coyne'),
 (2, 'Rebecca I.  Bloch'),
 (3, 'Paul   Caster'),
 (4, 'Jo Ann   Drusbosky'),
 (5, 'Arleen N.  Kardos')]

In [33]:
%%sql
DELETE FROM PROGRAM;

INSERT INTO PROGRAM  (ProgramCode, ProgramName)
SELECT DISTINCT program_code, program_name
FROM DataSet
ORDER BY program_code

 * sqlite:///CourseData.db
0 rows affected.
81 rows affected.

[]

In [34]:
%%sql
SELECT *
FROM PROGRAM
LIMIT 5

 * sqlite:///CourseData.db
Done.

[(1, None, None),
 (2, 'AC', 'Accounting'),
 (3, 'AE', 'Applied Ethics'),
 (4, 'AH', 'Art History'),
 (5, 'AN', 'Asian Studies')]

In [35]:
%%sql
SELECT ProgramID
FROM PROGRAM
LIMIT 5

 * sqlite:///CourseData.db
Done.

[(1,), (2,), (3,), (4,), (5,)]

In [36]:
%%sql
DELETE FROM COURSE;

INSERT INTO COURSE (CatalogID, ProgramID, CourseTitle, Description, Attributes, Coreqs, Prereqs, Fees, Credits)
SELECT DISTINCT catalog_id, PROGRAM.ProgramID, title, description, attributes, coreqs, prereqs, fees, credits_x
FROM DataSet
    JOIN PROGRAM ON (PROGRAM.ProgramName=DataSet.program_name)

 * sqlite:///CourseData.db
0 rows affected.
1972 rows affected.

[]

In [37]:
%%sql
SELECT *
FROM COURSE
LIMIT 5

 * sqlite:///CourseData.db
Done.

[('AC 0011', 1, 2, 'Introduction to Financial Accounting', 'This course introduces students to financial accounting. Students learn to read and comprehend published financial statements and are introduced to t ... (34 characters truncated) ... pics include financial statement analysis; accrual accounting; revenue and expense recognition; and accounting for assets, liabilities, and equities.', None, None, None, None, 3),
 ('AC 0012', 2, 2, 'Introduction to Management Accounting', 'This course introduces students to managerial accounting and the role of accounting information in managerial decision-making. Topics include a descr ... (203 characters truncated) ... , activity-based costing), so that students can make recommendations about performance evaluation, project evaluation and other management decisions.', None, None, 'AC 0011.', None, 3),
 ('AC 0203', 3, 2, 'Intermediate Accounting I', 'This course provides an in-depth study of financial accounting theory and concepts, and the presentation of financial statements in conformity with G ... (9 characters truncated) ... Accepted Accounting Principles (GAAP). The course emphasizes balance sheet valuations and their relationship to income measurement and determination.', None, None, 'AC 0011.', None, 3),
 ('AC 0204', 4, 2, 'Intermediate Accounting II', 'This course continues the in-depth study of financial accounting theory and concepts, and the presentation of financial statements in conformity with Generally Accepted Accounting Principles (GAAP) begun in ', None, None, 'AC 0203.', None, 3),
 ('AC 0310', 5, 2, 'Advanced Accounting', 'This course focuses on accounting for various financial investments, including financial instruments, derivatives, and business combinations. Student ... (17 characters truncated) ... role of financial instruments in hedging foreign currency exposures and the complications encountered in financial reporting in a global environment.', None, None, 'AC 0204; junior or senior standing.', None, 3)]

In [38]:
%%sql
DELETE FROM COURSE_MEETING;

INSERT INTO COURSE_MEETING (CatalogID, Location, StartDateTime, EndDateTime)
SELECT DISTINCT catalog_id, DataSet.location, start, end
FROM DataSet
    JOIN LOCATION ON (LOCATION.Location_Code = DataSet.Location)

 * sqlite:///CourseData.db
0 rows affected.
280529 rows affected.

[]

In [39]:
%%sql
SELECT *
FROM COURSE_MEETING
LIMIT 5

 * sqlite:///CourseData.db
Done.

[(1, 'AC 0011', 'DSB 105', '2014-09-02T08:00:00', '2014-09-02T09:15:00'),
 (2, 'AC 0011', 'DSB 105', '2014-09-05T08:00:00', '2014-09-05T09:15:00'),
 (3, 'AC 0011', 'DSB 105', '2014-09-09T08:00:00', '2014-09-09T09:15:00'),
 (4, 'AC 0011', 'DSB 105', '2014-09-12T08:00:00', '2014-09-12T09:15:00'),
 (5, 'AC 0011', 'DSB 105', '2014-09-16T08:00:00', '2014-09-16T09:15:00')]

In [40]:

%%sql
DELETE FROM COURSE_OFFERING;

INSERT INTO COURSE_OFFERING (CatalogID, CourseTitle, InstructorName, Section, Meetings, TimeCodes, Term, StartDay, End, Cap, Act, Rem)
SELECT DISTINCT catalog_id, title, primary_instructor, section, meetings, timecodes, term, start, end, cap, act, rem
FROM DataSet
     JOIN COURSE_MEETING ON (COURSE_MEETING.CatalogID = DataSet.catalog_id)
     JOIN INSTRUCTOR ON (INSTRUCTOR.InstructorName = DataSet.primary_instructor)
     LEFT JOIN COURSE ON (COURSE.CatalogID = DataSet.catalog_id)

 * sqlite:///CourseData.db
0 rows affected.
283781 rows affected.

[]

In [41]:
%%sql
SELECT *
FROM COURSE_OFFERING
LIMIT 5

 * sqlite:///CourseData.db
Done.

[(1, 'AC 0011', 'Introduction to Financial Accounting', 'Michael P.  Coyne', 'C01', "[{'days': 'TF', 'times': '0800am-0915am', 'dates': '09/02-12/08', 'location': 'DSB 105'}]", "['TF 0800am-0915am 09/02-12/08 DSB 105']", 'Fall2014', '2014-09-02T08:00:00', '2014-09-02T09:15:00', 0, 31, -31),
 (2, 'AC 0011', 'Introduction to Financial Accounting', 'Michael P.  Coyne', 'C01', "[{'days': 'TF', 'times': '0800am-0915am', 'dates': '09/02-12/08', 'location': 'DSB 105'}]", "['TF 0800am-0915am 09/02-12/08 DSB 105']", 'Fall2014', '2014-09-05T08:00:00', '2014-09-05T09:15:00', 0, 31, -31),
 (3, 'AC 0011', 'Introduction to Financial Accounting', 'Michael P.  Coyne', 'C01', "[{'days': 'TF', 'times': '0800am-0915am', 'dates': '09/02-12/08', 'location': 'DSB 105'}]", "['TF 0800am-0915am 09/02-12/08 DSB 105']", 'Fall2014', '2014-09-09T08:00:00', '2014-09-09T09:15:00', 0, 31, -31),
 (4, 'AC 0011', 'Introduction to Financial Accounting', 'Michael P.  Coyne', 'C01', "[{'days': 'TF', 'times': '0800am-0915am', 'dates': '09/02-12/08', 'location': 'DSB 105'}]", "['TF 0800am-0915am 09/02-12/08 DSB 105']", 'Fall2014', '2014-09-12T08:00:00', '2014-09-12T09:15:00', 0, 31, -31),
 (5, 'AC 0011', 'Introduction to Financial Accounting', 'Michael P.  Coyne', 'C01', "[{'days': 'TF', 'times': '0800am-0915am', 'dates': '09/02-12/08', 'location': 'DSB 105'}]", "['TF 0800am-0915am 09/02-12/08 DSB 105']", 'Fall2014', '2014-09-16T08:00:00', '2014-09-16T09:15:00', 0, 31, -31)]

In [42]:
%%sql
-- Ran into disc error and tested joins one-by-one
-- SELECT DISTINCT catalog_id, title, primary_instructor, ProgramID
-- FROM DataSet
    -- JOIN COURSE_MEETING ON (COURSE_MEETING.CatalogID = DataSet.catalog_id)
    -- JOIN INSTRUCTOR ON (INSTRUCTOR.InstructorName = DataSet.primary_instructor)
    -- LEFT JOIN COURSE ON (COURSE.CatalogID = DataSet.catalog_id)
-- LIMIT 5

 * sqlite:///CourseData.db
0 rows affected.

[]

In [43]:
%%sql
SELECT *
FROM COURSE_OFFERING
LIMIT 5

 * sqlite:///CourseData.db
Done.

[(1, 'AC 0011', 'Introduction to Financial Accounting', 'Michael P.  Coyne', 'C01', "[{'days': 'TF', 'times': '0800am-0915am', 'dates': '09/02-12/08', 'location': 'DSB 105'}]", "['TF 0800am-0915am 09/02-12/08 DSB 105']", 'Fall2014', '2014-09-02T08:00:00', '2014-09-02T09:15:00', 0, 31, -31),
 (2, 'AC 0011', 'Introduction to Financial Accounting', 'Michael P.  Coyne', 'C01', "[{'days': 'TF', 'times': '0800am-0915am', 'dates': '09/02-12/08', 'location': 'DSB 105'}]", "['TF 0800am-0915am 09/02-12/08 DSB 105']", 'Fall2014', '2014-09-05T08:00:00', '2014-09-05T09:15:00', 0, 31, -31),
 (3, 'AC 0011', 'Introduction to Financial Accounting', 'Michael P.  Coyne', 'C01', "[{'days': 'TF', 'times': '0800am-0915am', 'dates': '09/02-12/08', 'location': 'DSB 105'}]", "['TF 0800am-0915am 09/02-12/08 DSB 105']", 'Fall2014', '2014-09-09T08:00:00', '2014-09-09T09:15:00', 0, 31, -31),
 (4, 'AC 0011', 'Introduction to Financial Accounting', 'Michael P.  Coyne', 'C01', "[{'days': 'TF', 'times': '0800am-0915am', 'dates': '09/02-12/08', 'location': 'DSB 105'}]", "['TF 0800am-0915am 09/02-12/08 DSB 105']", 'Fall2014', '2014-09-12T08:00:00', '2014-09-12T09:15:00', 0, 31, -31),
 (5, 'AC 0011', 'Introduction to Financial Accounting', 'Michael P.  Coyne', 'C01', "[{'days': 'TF', 'times': '0800am-0915am', 'dates': '09/02-12/08', 'location': 'DSB 105'}]", "['TF 0800am-0915am 09/02-12/08 DSB 105']", 'Fall2014', '2014-09-16T08:00:00', '2014-09-16T09:15:00', 0, 31, -31)]

In [44]:
%%sql
SELECT *
FROM COURSE

LIMIT 5

 * sqlite:///CourseData.db
Done.

[('AC 0011', 1, 2, 'Introduction to Financial Accounting', 'This course introduces students to financial accounting. Students learn to read and comprehend published financial statements and are introduced to t ... (34 characters truncated) ... pics include financial statement analysis; accrual accounting; revenue and expense recognition; and accounting for assets, liabilities, and equities.', None, None, None, None, 3),
 ('AC 0012', 2, 2, 'Introduction to Management Accounting', 'This course introduces students to managerial accounting and the role of accounting information in managerial decision-making. Topics include a descr ... (203 characters truncated) ... , activity-based costing), so that students can make recommendations about performance evaluation, project evaluation and other management decisions.', None, None, 'AC 0011.', None, 3),
 ('AC 0203', 3, 2, 'Intermediate Accounting I', 'This course provides an in-depth study of financial accounting theory and concepts, and the presentation of financial statements in conformity with G ... (9 characters truncated) ... Accepted Accounting Principles (GAAP). The course emphasizes balance sheet valuations and their relationship to income measurement and determination.', None, None, 'AC 0011.', None, 3),
 ('AC 0204', 4, 2, 'Intermediate Accounting II', 'This course continues the in-depth study of financial accounting theory and concepts, and the presentation of financial statements in conformity with Generally Accepted Accounting Principles (GAAP) begun in ', None, None, 'AC 0203.', None, 3),
 ('AC 0310', 5, 2, 'Advanced Accounting', 'This course focuses on accounting for various financial investments, including financial instruments, derivatives, and business combinations. Student ... (17 characters truncated) ... role of financial instruments in hedging foreign currency exposures and the complications encountered in financial reporting in a global environment.', None, None, 'AC 0204; junior or senior standing.', None, 3)]

In [45]:
%%sql

SELECT *
FROM COURSE_OFFERING
WHERE CatalogID="AC 0011"
LIMIT 5

 * sqlite:///CourseData.db
Done.

[(1, 'AC 0011', 'Introduction to Financial Accounting', 'Michael P.  Coyne', 'C01', "[{'days': 'TF', 'times': '0800am-0915am', 'dates': '09/02-12/08', 'location': 'DSB 105'}]", "['TF 0800am-0915am 09/02-12/08 DSB 105']", 'Fall2014', '2014-09-02T08:00:00', '2014-09-02T09:15:00', 0, 31, -31),
 (2, 'AC 0011', 'Introduction to Financial Accounting', 'Michael P.  Coyne', 'C01', "[{'days': 'TF', 'times': '0800am-0915am', 'dates': '09/02-12/08', 'location': 'DSB 105'}]", "['TF 0800am-0915am 09/02-12/08 DSB 105']", 'Fall2014', '2014-09-05T08:00:00', '2014-09-05T09:15:00', 0, 31, -31),
 (3, 'AC 0011', 'Introduction to Financial Accounting', 'Michael P.  Coyne', 'C01', "[{'days': 'TF', 'times': '0800am-0915am', 'dates': '09/02-12/08', 'location': 'DSB 105'}]", "['TF 0800am-0915am 09/02-12/08 DSB 105']", 'Fall2014', '2014-09-09T08:00:00', '2014-09-09T09:15:00', 0, 31, -31),
 (4, 'AC 0011', 'Introduction to Financial Accounting', 'Michael P.  Coyne', 'C01', "[{'days': 'TF', 'times': '0800am-0915am', 'dates': '09/02-12/08', 'location': 'DSB 105'}]", "['TF 0800am-0915am 09/02-12/08 DSB 105']", 'Fall2014', '2014-09-12T08:00:00', '2014-09-12T09:15:00', 0, 31, -31),
 (5, 'AC 0011', 'Introduction to Financial Accounting', 'Michael P.  Coyne', 'C01', "[{'days': 'TF', 'times': '0800am-0915am', 'dates': '09/02-12/08', 'location': 'DSB 105'}]", "['TF 0800am-0915am 09/02-12/08 DSB 105']", 'Fall2014', '2014-09-16T08:00:00', '2014-09-16T09:15:00', 0, 31, -31)]

In [46]:
%%sql

SELECT *
FROM COURSE_OFFERING
WHERE CatalogID="AC 0011"
LIMIT 5

 * sqlite:///CourseData.db
Done.

[(1, 'AC 0011', 'Introduction to Financial Accounting', 'Michael P.  Coyne', 'C01', "[{'days': 'TF', 'times': '0800am-0915am', 'dates': '09/02-12/08', 'location': 'DSB 105'}]", "['TF 0800am-0915am 09/02-12/08 DSB 105']", 'Fall2014', '2014-09-02T08:00:00', '2014-09-02T09:15:00', 0, 31, -31),
 (2, 'AC 0011', 'Introduction to Financial Accounting', 'Michael P.  Coyne', 'C01', "[{'days': 'TF', 'times': '0800am-0915am', 'dates': '09/02-12/08', 'location': 'DSB 105'}]", "['TF 0800am-0915am 09/02-12/08 DSB 105']", 'Fall2014', '2014-09-05T08:00:00', '2014-09-05T09:15:00', 0, 31, -31),
 (3, 'AC 0011', 'Introduction to Financial Accounting', 'Michael P.  Coyne', 'C01', "[{'days': 'TF', 'times': '0800am-0915am', 'dates': '09/02-12/08', 'location': 'DSB 105'}]", "['TF 0800am-0915am 09/02-12/08 DSB 105']", 'Fall2014', '2014-09-09T08:00:00', '2014-09-09T09:15:00', 0, 31, -31),
 (4, 'AC 0011', 'Introduction to Financial Accounting', 'Michael P.  Coyne', 'C01', "[{'days': 'TF', 'times': '0800am-0915am', 'dates': '09/02-12/08', 'location': 'DSB 105'}]", "['TF 0800am-0915am 09/02-12/08 DSB 105']", 'Fall2014', '2014-09-12T08:00:00', '2014-09-12T09:15:00', 0, 31, -31),
 (5, 'AC 0011', 'Introduction to Financial Accounting', 'Michael P.  Coyne', 'C01', "[{'days': 'TF', 'times': '0800am-0915am', 'dates': '09/02-12/08', 'location': 'DSB 105'}]", "['TF 0800am-0915am 09/02-12/08 DSB 105']", 'Fall2014', '2014-09-16T08:00:00', '2014-09-16T09:15:00', 0, 31, -31)]

In [47]:
%%sql
SELECT *
FROM COURSE_MEETING
LIMIT 5

 * sqlite:///CourseData.db
Done.

[(1, 'AC 0011', 'DSB 105', '2014-09-02T08:00:00', '2014-09-02T09:15:00'),
 (2, 'AC 0011', 'DSB 105', '2014-09-05T08:00:00', '2014-09-05T09:15:00'),
 (3, 'AC 0011', 'DSB 105', '2014-09-09T08:00:00', '2014-09-09T09:15:00'),
 (4, 'AC 0011', 'DSB 105', '2014-09-12T08:00:00', '2014-09-12T09:15:00'),
 (5, 'AC 0011', 'DSB 105', '2014-09-16T08:00:00', '2014-09-16T09:15:00')]

In [48]:
%%sql
SELECT 
    (SELECT Count(*) FROM COURSE) as CatalogCourses,
    (SELECT Count(*) FROM COURSE_OFFERING) as CourseOfferings,
    (SELECT Count(*) FROM COURSE_MEETING) as CourseMeetings;

 * sqlite:///CourseData.db
Done.

[(1972, 283781, 280529)]

In [49]:
%%sql
DELETE FROM DataSet;

 * sqlite:///CourseData.db
284925 rows affected.

[]

In [50]:
%%sql
DROP TABLE DataSet;

 * sqlite:///CourseData.db
Done.

[]

In [52]:
%%sql
vacuum;

 * sqlite:///CourseData.db
Done.

[]